#Основа
a = int(input("Введите первое число\n"))
b = int(input("Введите второе число\n"))

#1
c = a + b
d = a - b
e = c * d
print(f'произведение суммы {a} и {b} на разность {a} и {b} = {c} * {d} = {e}')

#2
print(f'a**2 - 2 * a * b + b**2 = {a**2 - 2 * a * b + b**2}')

#3
print(f'a**2 + 2 * a * b + b**2 = {a**2 + 2 * a * b + b**2}')

#4
print(f'a**3 - 3 * a**2 + 3 * a * b**2 + b**3 = {a**3 - 3 * a**2 + 3 * a * b**2 + b**3}')

#5
print(f'a**3 + 3 * a**2 + 3 * a * b**2 + b**3 = {a**3 + 3 * a**2 + 3 * a * b**2 + b**3}')

#6
print(f'a**2 - 2 * a * b + b**2 * a + b = {(a**2 - 2 * a * b + b**2) * c}')

#7
print(f'a**2 + 2 * a * b + b**2 * a - b = {(a**2 + 2 * a * b + b**2) * d}')
